U_1500 = [40.98 94.25 143.4 184.4 225.3 266.2 307.1 348 401.3 450.3 491 532];
I_1500 = [0.31 0.713 1.085 1.395 1.705 2.015 2.325 2.635 3.04 3.41 3.72 4.03];

U_1200 = [65 130 195.2 260 325 390 455 520];
I_1200 = [0.62 1.24 1.86 2.48 3.1 3.72 4.34 4.96];

U_1800 = [4.9 98 147.5 196.8 245.9 295 344.3 393.4 442.5 491.7];
I_1800 = [0.031 0.62 0.93 1.24 1.55 1.86 2.17 2.48 2.79 3.1];

IF_brax = [0.031 0.155 0.31 0.46 0.62 0.93 1.24 1.55 1.86 2.48 3.02 3.1 4.65 5.58 6.2 6.82];
IK_brax = [0.067 0.33 0.66 1.0 1.3 2.0 2.7 3.33 4.0 5.3 6.5 6.7 9.8 12.0 13.3 14.6];
%if0 = 3.03 me ik0 = 5.3
%PN/4
If_dikt_4 = [1.55 1.86 2.17 2.48 2.79 3.1 3.41 3.72 4.03 4.34 4.65 4.96 5.27 6.0 6.4 7.1];
Is_dikt_4 = [4.72 4.1 3.6 3.2 2.87 2.8 2.7 2.87 3.17 3.6 4.1 4.6 5.2 6.8 7.4 9];
cosf_4 = 1820/(sqrt(3)*400);
cosf_4 = cosf_4./Is_dikt_4;

%PN/2
If_dikt_2 = [1.5 1.87 2.24 2.61 2.98 3.35 3.72 4.09 4.46 4.83 5.2 5.57 5.94 6.31 6.68 7.1];
Is_dikt_2 = [8.4 7.49 6.84 6.23 5.66 5.39 5.25 5.3 5.48 5.8 6.28 6.8 7.42 8 8.68 9.43];
cosf_2 = 3645/(sqrt(3)*400);
cosf_2 = cosf_2./Is_dikt_2;

figure(1)
subplot(3,1,1);
plot(I_1500,U_1500);
xlabel("If (A)");
ylabel("Us (V)");
title("Εν κενώ στις 1500 στροφές");

subplot(3,1,2);
plot(I_1200,U_1200);
xlabel("If (A)");
ylabel("Us (V)");
title("Εν κενώ στις 1200 στροφές");

subplot(3,1,3);
plot(I_1800,U_1800);
xlabel("If (A)");
ylabel("Us (V)");
title("Εν κενώ στις 1800 στροφές");

figure(2)
plot(IF_brax,IK_brax);
xlabel("If (A)");
ylabel("Is (A)");
title("Πείραμα βραχυκύκλωσης");

figure(3)
subplot(2,1,1)
plot(If_dikt_4,Is_dikt_4);
xlabel("If (A)");
ylabel("Is (A)");
title("χαρακτητιστική Is με If στο δίκτυο για Pn/4");

subplot(2,1,2)
plot(If_dikt_4,cosf_4);
xlabel("If (A)");
ylabel("cosφ");
title("cosφ");

figure(4)
subplot(2,1,1)
plot(If_dikt_2,Is_dikt_2);
xlabel("If (A)");
ylabel("Is (A)");
title("χαρακτητιστική Is με If στο δίκτυο για Pn/2");

subplot(2,1,2)
plot(If_dikt_2,cosf_2);
xlabel("If (A)");
ylabel("cosφ");
title("cosφ");